[
  {
    "imdbID": "tt0144084",
    "title": "American Psycho",
    "rating": 10,
    "watched": "2022-06-18",
    "summary": "Based sigma male grindset."
  },
  {
    "imdbID": "tt1401143",
    "title": "Rare Exports",
    "rating": 7,
    "watched": "2021-12-28",
    "summary": "Dark and twisted take on Santa claus in the Finnish arctic. The tension and buildup is great and I especially like the design of santa and his helpers, but could have used less family movie cliché tropes."
  },
  {
    "imdbID": "tt5109280",
    "title": "raya and the last dragon",
    "rating": 9,
    "watched": "2021-12-28",
    "summary": "Beautiful animation, funny dragon, interesting world building, well choreographed fight scenes. Top tier feel-good movie."
  },
  {
    "imdbID": "tt2704998",
    "title": "Game night",
    "rating": 8,
    "watched": "2021-12-28",
    "summary": "Funny jokes and incredible plot twists keep this movie interesting. The tilt-shift lens shots give it a unique look and are a joy to watch if you enjoy nerding over camerawork."
  },
  {
    "imdbID": "tt10016180",
    "title": "The little things",
    "rating": 3,
    "watched": "2021-12-29",
    "summary": "The premise is interesting, unfortunately the story never goes anywhere, there is no character development, just nothing. Very dull movie overall."
  },
  {
    "imdbID": "tt4244998",
    "title": "alpha",
    "rating": 1,
    "watched": "2021-12-29",
    "summary": "Very boring, main character is unrelatable and makes dumb decisions. Story makes no sense and just drags on. Wanted to stop watching at multiple points."
  },
  {
    "imdbID": "tt4160708",
    "title": "dont breathe",
    "rating": 6,
    "watched": "2021-12-29",
    "summary": "Very scary and disturbing, I was on the edge of my seat the whole time. Have to knock some stars off just because I was so disgusted that I had to cover my eyes at points."
  },
  {
    "imdbID": "tt2883512",
    "title": "chef",
    "rating": 9,
    "watched": "2021-06-12",
    "summary": "As a food enjoyer and a perfectionist I really liked this and could relate to Jon Favreau's character. Nice and heartwarming movie with an awfully rare happy ending."
  },

  {
    "imdbID": "tt7888964",
    "title": "nobody",
    "rating": 10,
    "watched": "2021-12-30",
    "summary": "John Wick-esque film about a badass who takes justice into his own hands. The action scenes are enjoyable and the main character is relatable. Overall a very fun movie."
  },
  {
    "imdbID": "tt11083552",
    "title": "wrath of man",
    "rating": 8,
    "watched": "2021-12-30",
    "summary": "Fun action movie, interesting premise with some unexpected plot twists. Jason Statham is the perfect actor for the role of the cold blooded killer who will do anything to avenge his son."
  },
  {
    "imdbID": "tt1160419",
    "title": "Dune",
    "rating": 6,
    "watched": "2021-12-31",
    "summary": "Plot was hard to follow and I didn't really understand what was happening. Pacing could have been better. There were some cool scenes though and the worldbuilding is great."
  },
  {
    "imdbID": "tt4479380",
    "title": "sas rise of the black swan",
    "rating": 5,
    "watched": "2022-01-02",
    "summary": "It's a bit corny, dialogue could use some work. Enjoyable action but very forgettable."
  },
  {
    "imdbID": "tt0356910",
    "title": "mr and mrs smith",
    "rating": 9,
    "watched": "2022-01-02",
    "summary": "The tongue in cheek humor combined with interesting plot and great action scenes make this movie a certified cult classic. The chemistry between Brad Pitt and Angelina Jolie is enjoyable."
  },
  {
    "imdbID": "tt7737528",
    "title": "Kate",
    "rating": 8,
    "watched": "2022-01-03",
    "summary": "John wick but make it girl instead. Well choreographed fights, awesome visuals and interesting japanese popular culture influence. Interactions between the two main characters are funny and the worldbuilding is great."
  }
]
